{
  "name": "Gregory Lemieux",
  "meta": {
    "format": "FRESH@0.6.0",
    "version": "0.1.0"
  },
  "info": {
    "label": "Computational Engineer",
    "brief": "I'm an engineer with a passion for developing scientfic software applications to help solve some of the most pressing problems facing our world.  My particular interest lies in applied optimization and towards this end I am pursuing a graduate degree, part-time, with a focus on Computational Engineering.  I have a broad technical background developed through work in both academic and industrial organizations, providing both research-oriented and commericially-focused products and services.  As such, I am extremely comfortable communicating within a variety of environments and have a proven ability to adapt to changing responsibilities based on evolving project requirements.",
    "image": ""
  },
  "social": [
    {
      "label": "",
      "network": "GitHub",
      "user": "glemieux",
      "url": "https://github.com/glemieux"
    },
    {
      "label": "",
      "network": "LinkedIn",
      "user": "gregorylemieux",
      "url": "https://linkedin.com/in/gregorylemieux"
    }
  ],
  "employment": {
    "summary": "Optional overall employment summary. Not used in most themes.",
    "history": [
      {
        "employer": "[SSL](http://sslmda.com)",
        "url": "http://sslmda.com",
        "position": "Systems Engineering Specialist",
        "start": "2012-04",
        "keywords": [],
        "highlights": [
          "Developing the next-generation orbit propagator for controls design and Vehicle Hardware Lab simulation as well as the on-board flight software orbit estimation Kalman filter.",
          "Collaboratively building a Git submodule-based simulation architecture to enable code reuse and standardization for the Mathworks environment.",  
          "Devised a package management system to automatically check and load necessary library dependencies for simulation submodules.",
          "Implementing Mathworks-based autocode generation toolchain to help streamline flight software build efforts.",
          "Produced new, Jupyter and Julia-based mission analysis tools for the NASA [Restore-L](https://sspd.gsfc.nasa.gov/restore-L.html) mission to help guide hardware subsystems decision-making which included a sensor placement optimization and visualization tool.",
          "Expanded verification and validation test routines for inherited Chebyshev-based ephemeris approximation code.", 
          "Founding member of the Guidance, Navigation and Control Software Development Working Group which formed consensus-based guidelines for common code utilized by multiple departments.",
          "Acted as the Responsible Engineer on and conducted critical orbit-raising maneuvers for more than five geosynchronous communication programs.",
          "Developed onboading documentation to help train new hires to the heritage mission analysis tool set."
        ]
      },
      {
        "employer": "[Space Science Laboratory](http://www.ssl.berkeley.edu/)",
        "url": "http://www.ssl.berkeley.edu/",
        "position": "Research and Development Engineer",
        "start": "2008-06",
        "end": "2012-04",
        "keywords": [],
        "highlights": [
          "Developed science data accumulation forecasting tool to aid in real-time planning for mission critical science collection activities.",
          "Integrated [DSN Service Scheduling Software](https://ai.jpl.nasa.gov/public/projects/sss/) into active mission operation scheduling architecture and process.",
          "Helped Flight Dynamics team replace inhouse developed functions with more capable JPL SPICE toolkit functions.",
          "Contributed to the Deep Space Network Scheduling Advisory and Mid-range Management Groups to prepare for deployment of next-generation scheduling process.",
          "Scheduled [ARTEMIS](http://artemis.ssl.berkeley.edu/) mission supports including critical Lunar Orbit Insertion.",
          "Participated in the integration and test activities for the [NUSTAR](http://www.nustar.caltech.edu) mission."

        ]
      },
      {
        "employer": "[Janos Technology](http://www.janostech.com/)",
        "url": "http://www.janostech.com/",
        "position": "Opto-mechanical Engineer",
        "start": "2003-12",
        "end": "2006-05",
        "keywords": [],
        "highlights": [
          "Designed infrared lens assemblies for commercial, defense, and research applications in coordination with staff optical scientist.",
          "Represented the Engineering department as a member of the company-wide Quality Control Committee seeking AS9100 compliance.",
          "Conducted performance tests for multiple types of lens assemblies using a scanning-slit modular transfer function (MTF) test bench."
        ]
      },
      {
        "employer": "[Center for Space Physics](https://www.bu.edu/csp/)",
        "url": "https://www.bu.edu/csp/",
        "position": "Mechanical Engineer",
        "start": "2001-09",
        "end": "2003-06",
        "keywords": [],
        "highlights": [
          "Designed and developed the vacuum-sealed opto-mechanical assembly for the main science payload for the SPIDR NASA mission proposal.",
          "Conducted both simulated and real-world structural analysis using finite element model to guide the build of test flight hardware.",
          "Produced failure modes and effects analysis documentation for payload hardware failure mitigation."

        ]
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Scientific Programming",
        "level": "",
        "skills": [
          "Matlab/Simulink",
          "Julia",
          "NumPy"
        ]
      },
      {
        "name": "Source Control",
        "level": "",
        "skills": [
          "Git",
          "Subversion"
        ]
      },
      {
        "name": "Documentation",
        "level": "",
        "skills": [
          "Markdown",
          "TeX",
          "Pandoc"
        ]
      },
      {
        "name": "Productivity",
        "level": "",
        "skills":[
          "VScode",
          "Jupyter",
          "Vim"
        ]

      },
      {
        "name": "Operating Systems",
        "level": "",
        "skills": [
          "Linux",
          "macOS",
          "Windows"
        ]
      }
    ],
    "list": []
  }
}